app/controllers/suggetions_controller.rb

SELECT `suggetions`.* FROM `suggetions`
---
  def index
    @suggetions = Suggetion.all

SELECT  `suggetions`.* FROM `suggetions` WHERE `suggetions`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @suggetion = Suggetion.find(params[:id])

INSERT INTO `suggetions` (`username`, `customername`, `moviedate`, `estimatedate`, `closestatus`, `memo`, `flag`, `created_at`, `updated_at`) VALUES ('東海 太郎', '櫻糀 冬木', '2018-09-23 12:17:00', '2018-09-23 12:17:00', '不成約', '', FALSE, '2018-09-23 12:18:28', '2018-09-23 12:18:28')
---
  def create
    @suggetion = Suggetion.new(suggetion_params)

    respond_to do |format|
      if @suggetion.save

UPDATE "suggetions" SET "closestatus" = ?, "updated_at" = ? WHERE "suggetions"."id" = ?  [["closestatus", "満期キャッチshitayo!"], ["updated_at", "2018-09-15 01:54:55.520376"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @suggetion.update(suggetion_params)

SELECT  "suggetions".* FROM "suggetions" WHERE "suggetions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_suggetion
      @suggetion = Suggetion.find(params[:id])